fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбоненсткаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_РаботаСФормами/Module.bsl
//ВКМ++, 15.06.2026
#Область СлужебныеПроцедурыИФункции
Процедура ДополнитьФорму (Форма) Экспорт 
	//Дополняем форму Документа РеализацияТоваровУслуг кнопкой "Заполнить"
	ИмяФормы = Форма.ИмяФормы;

	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
			
		Команда = Форма.Команды.Добавить("Заполнить"); 
		Команда.Заголовок = "Заполнить";
		Команда.Действие = "КомандаВыполнитьАвтозаполнение";
		
		Кнопка = Форма.Элементы.Добавить("КнопкаВыполнитьАвтозаполнение", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаПраво);
		Кнопка.ИмяКоманды = "Заполнить";
		Кнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		
	КонецЕсли;
	
	//Дополняем форму Справочника ДоговорыКонтрагентов полями ДатаНачала, ДатаОкончания, АбонентскаяПлата, СтоимостьЧаса
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		
		Группа = Форма.Элементы.Добавить("ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"), Форма);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.Заголовок = "Абонентская плата";
		Группа.ОтображатьЗаголовок = Истина;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		
		Группа = Форма.Элементы.Добавить("ГруппаПериодДоговора", Тип("ГруппаФормы"), Форма.Элементы.ГруппаАбонентскоеОбслуживание);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;;
		
		ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДоговора);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		
		ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДоговора);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
		
		ПолеВвода = Форма.Элементы.Добавить("ВКМ_АбоненсткаяПлата", Тип("ПолеФормы"), Форма.Элементы.ГруппаАбонентскоеОбслуживание);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбоненсткаяПлата";
		
		ПолеВвода = Форма.Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"), Форма.Элементы.ГруппаАбонентскоеОбслуживание);
		ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	
	КонецЕсли;
КонецПроцедуры 

#КонецОбласти
//ВКМ--, 15.06.2026
